---
kind: method
id: M:Autodesk.Revit.DB.DirectShape.SetName(System.String)
source: html/9ff002c5-3197-9feb-bd85-a497ad2c6f14.htm
---
# Autodesk.Revit.DB.DirectShape.SetName Method

Sets the name for the DirectShape element.

## Syntax (C#)
```csharp
public void SetName(
	string name
)
```

## Parameters
- **name** (`System.String`) - The name.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null